tests/artillery/scenarios/business.scenarios.yaml
config:
  target: "https://transactions-backend.test.devpayever.com/api"
  phases:
    - duration: 1
      arrivalRate: 1
  http:
    timeout: 10
  processor: "../processors/business.js"
  variables:
    authUrl: "https://auth.test.devpayever.com/api"
    userUrl: "https://users.test.devpayever.com/api"
    email: "rob@top.com"
    plainPassword: "Test1234!"
  default:
    headers:
      content-type: "application/json"
  environments:
    test:
      target: "https://transactions-backend.test.devpayever.com/api"
      phases:
        - duration: 1
          arrivalRate: 1
      variables:
        authUrl: "https://auth.test.devpayever.com/api"
        userUrl: "https://users.test.devpayever.com/api"
        email: "rob@top.com"
        plainPassword: "Test1234!"
    staging:
      target: "https://transactions-backend.staging.devpayever.com/api"
      phases:
        - duration: 1
          arrivalRate: 1
      variables:
        authUrl: "https://auth.staging.devpayever.com/api"
        userUrl: "https://users.staging.devpayever.com/api"
        email: "rob@top.com"
        plainPassword: "Test1234!"
scenarios:
  - name: "Business"
    flow:
      - function: "defineVariables"
      - log: "Login"
      - post:
          url: "{{ authUrl }}/login"
          json:
            email: "{{ email }}"
            plainPassword: "{{ plainPassword }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - log: "Get business ID"
      - get:
          url: "{{ userUrl }}/business"
          headers:
            authorization: "Bearer {{ accessToken }}"
          afterResponse: "defineBusinessId"
      - log: "GET /business/{{ businessId }}/list"
      - get:
          url: "/business/{{ businessId }}/list"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/mongo"
      - get:
          url: "/business/{{ businessId }}/mongo"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/export"
      - get:
          url: "/business/{{ businessId }}/export"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/settings"
      - get:
          url: "/business/{{ businessId }}/settings"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "POST /business/{{ businessId }}/trigger-example"
      - post:
          url: "/business/{{ businessId }}/trigger-example"
          headers:
            authorization: "Bearer {{ accessToken }}"
          json:
            _id: "{{ business_Id }}"
            name: "{{ businessName }}"
            currency: "EUR"
            companyAddress:
              country: "Germany"
            companyDetails:
              product: "product"
      - log: "GET /business/{{ businessId }}/detail/reference/{{ reference }}"
      - get:
          url: "/business/{{ businessId }}/detail/reference/{{ reference }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/detail/original_id/{{ originalId }}"
      - get:
          url: "/business/{{ businessId }}/detail/original_id/{{ originalId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/detail/{{ transactionId }}"
      - get:
          url: "/business/{{ businessId }}/detail/{{ transactionId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"