tests/artillery/scenarios/user.scenarios.yaml
config:
  target: "https://transactions-backend.test.devpayever.com/api"
  phases:
    - duration: 1
      arrivalRate: 1
  http:
    timeout: 10
  processor: "../processors/user.js"
  variables:
    authUrl: "https://auth.test.devpayever.com/api"
    email: "rob@top.com"
    plainPassword: "Test1234!"
  default:
    headers:
      content-type: "application/json"
  environments:
    test:
      target: "https://transactions-backend.test.devpayever.com/api"
      phases:
        - duration: 1
          arrivalRate: 1
      variables:
        authUrl: "https://auth.test.devpayever.com/api"
        email: "rob@top.com"
        plainPassword: "Test1234!"
    staging:
      target: "https://transactions-backend.staging.devpayever.com/api"
      phases:
        - duration: 1
          arrivalRate: 1
      variables:
        authUrl: "https://auth.staging.devpayever.com/api"
        email: "rob@top.com"
        plainPassword: "Test1234!"
scenarios:
  - name: "User"
    flow:
      - log: "Login"
      - post:
          url: "{{ authUrl }}/login"
          json:
            email: "{{ email }}"
            plainPassword: "{{ plainPassword }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - log: "GET /user/list"
      - get:
          url: "/user/list"
          headers:
            authorization: "Bearer {{ accessToken }}"
          afterResponse: "defineUserId"
      - log: "GET /user/mongo"
      - get:
          url: "/user/mongo"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /user/detail/{{ userId }}"
      - get:
          url: "/user/detail/{{ userId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /user/settings"
      - get:
          url: "/user/settings"
          headers:
            authorization: "Bearer {{ accessToken }}"